app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" ORDER BY "authors"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2020-06-24 02:01:15.425625"], ["updated_at", "2020-06-24 02:01:15.425625"], ["author_id", 1]]
---
  def create
    # hard code, linking every post to the very first author in the database
    @author = Author.first
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.author_id = @author.id
    @post.save